Repository: pepr/LearningToProgram2CZ
Catalog: en/align_2013.05.07_09.17.36/tutbranch-cztutbranch.tmx
Source language: en
Languages: cs

source: Decisions, Decisions
cs: Větvení, aneb nechť padne rozhodnutí

source: What will we cover?
cs: O čem si budeme povídat?

source: The 3rd programming construct - Branching
cs: Třetí programová konstrukce — větvení.

source: Single branches and multiple branches
cs: Jednoduché a násobné větvení.

source: Using Boolean expressions
cs: Použití boolovských výrazů.

source: The 3rd of our fundamental building blocks is branching or conditional statements.
cs: Třetím z našich základních stavebních kamenů je větvení nebo také podmíněný příkaz.

source: These are simply terms to describe the ability within our programs to execute one of several possible sequences of code(branches) depending on some condition.
cs: Jde jednoduše o pojmy, které popisují schopnost provést jednu z několika možných posloupností příkazů (jednu z větví) a to v závislosti na nějaké podmínce.

source: Back in the early days of Assembler programming the simplest branch was a JUMP instruction where the program literally jumped to a specified memory address, usually if the result of the previous instruction was zero.
cs: Dříve, v době programování v assembleru, bylo větvení realizováno nejjednodušším možným způsobem — použitím instrukce JUMP. Program v tomto místě doslova skočil na určenou adresu v paměti. Obvykle to bylo podmíněno tím, že výsledkem předchozí instrukce byla nula.

source: Amazingly complex programs were written with virtually no other form of condition possible - vindicating Dijkstra's statement about the minimum requirements for programming.
cs: I když nebylo možné použít jiný způsob realizace podmíněného příkazu, byly takto napsány úžasně složité programy. To potvrzovalo správnost Dijkstrových tvrzení o minimálních požadavcích potřebných pro programování.

source: When high level languages came along a new version of the JUMP instruction appeared called GOTO.
cs: Když se objevily vyšší programovací jazyky, objevila se i nová podoba instrukce JUMP pod názvem GOTO.

source: In fact QBASIC, which is still supplied on the CD ROM with older versions of Windows(pre XP), still provides GOTO and, if you have QBASIC installed, you can try it out by typing the following bit of code:
cs: V jazyce QBASIC, který byl dodáván na instalačních CD ROM starších verzí Windows (před XP), lze GOTO stále používat. Pokud máte QBASIC nainstalován, můžete si vyzkoušet následující úsek kódu:

source: 10 PRINT "Starting at line 10" 20 J = 5 30 IF J
cs: 10 PRINT "Začínáme na řádku 10" 20 J = 5 30 IF J

source: Notice how even in such a short program it takes a few seconds to figure out what's going to happen.
cs: Povšimněte si, že dokonce i u tak krátkého programu trvá několik sekund, než přijdete na to co se stane.

source: There is no structure to the code, you have to literally figure it out as you read it. In large programs it becomes impossible.
cs: Kód nemá žádnou strukturu. Musíte si ji během čtení doslova vytvořit. U velkých programů to začne být prakticky nemožné.

source: For that reason most modern programming languages, including Python, VBScript and JavaScript, either don't have a direct JUMP or GOTO statement or discourage you from using it.
cs: Z tohoto důvodu většina moderních programovacích jazyků — včetně jazyků Python, VBScript a JavaScript — buď příkazy skoku JUMP nebo GOTO nemají, nebo vás od jejich používání odrazují.

source: So what do we use instead?
cs: Takže co bychom vlastně místo nich měli použít?

source: The if statement
cs: Příkaz if

source: The most intuitively obvious conditional statement is the if, then, else construct.
cs: Intuitivně nejzřejmější podobou podmíněného příkazu je konstrukce if, then, else.

source: It follows the logic of English in that if some boolean condition (see below for more about this aspect of things) is true then a block of statements is executed, otherwise (or else ) a different block is executed.
cs: Sleduje logiku anglické věty v tom smyslu, že if (jestliže) je nějaká boolovská podmínka splněna (o boolovských podmínkách se zmíníme dále v textu), then (pak) se provede blok příkazů, v opačném případě (nebo else (jinak)) se provede jiný blok.

source: It looks like this in Python:
cs: V jazyce Python vypadá zápis takto:

source: import sys # only to let us exit print "Starting here" j = 5 if j > 10: print "This is never printed" else: sys.exit()
cs: import sys # jen proto, abychom mohli program ukončit print "Začínáme zde" j = 5 if j > 10: print "Toto se nikdy nevytiskne" else: sys.exit()

source: Hopefully that is easier to read and understand than the previous GOTO example.
cs: Takový zápis se ve srovnání s předchozím příkazem s GOTO lépe čte a je srozumitelnější.

source: Of course we can put any test condition we like after the if, so long as it evaluates to True or False, i.e. a boolean value.
cs: Za slovo if můžeme samozřejmě dosadit libovolnou podmínku testu za předpokladu, že ji lze vyhodnotit jako True nebo False — to znamená jako boolovskou hodnotu.

source: Try changing the > to a < and see what happens.
cs: Zkuste změnit operátor > na < a pozorujte, co se stane.

source: VBScript looks quite similar:
cs: Zápis v jazyce VBScript vypadá podobně:

source: <script language="VBScript"> MsgBox "Starting Here" DIM J J = 5 If J > 10 Then MsgBox "This is never printed" Else MsgBox "End of Program" End If </script>
cs: <script type="text/vbscript"> MsgBox "Začínáme zde" Dim J J = 5 If J > 10 Then MsgBox "Toto se nikdy nevytiskne." Else MsgBox "Konec programu." End If </script>

source: It's very nearly identical, isn't it?
cs: Vždyť je to téměř shodné, že ano?

source: The main difference is the use of End If to indicate the end of the construct.
cs: Hlavní rozdíl spočívá v použití End If pro označení konce konstrukce.

source: And JavaScript too
cs: A ještě v JavaScript

source: And of course JavaScript has an if statement too:
cs: V jazyce JavaScript nalezneme samozřejmě příkaz if také:

source: <script language="JavaScript"> var j; j = 5; if (j > 10){ document.write("This is never printed"); } else { document.write("End of program"); } </script>
cs: <script type="text/javascript"> var j; j = 5; if (j > 10){ document.write("Toto se nikdy nevytiskne."); } else { document.write("Konec programu."); } </script>

source: Notice that JavaScript uses curly braces to define the blocks of code inside the if part and the else part.
cs: Povimněte si, že JavaScript používá uvnitř částí if a else pro vymezení bloku kódu složené závorky.

source: Also the boolean test is contained in parentheses and there is no explicit keyword then used.
cs: Boolovský test je rovněž uzavřen v závorkách. Klíčové slovo then se zde nepoužívá.

source: On a point of style, the curly braces can be located anywhere, I have chosen to line them up as shown purely to emphasize the block structure.
cs: Co se týká stylu, složené závorky můžeme umístit na libovolnou pozici. Rozhodl jsem se, že je zarovnám pod sebe prostě proto, abych zdůraznil strukturu bloku.

source: Also if there is only a single line within the block (as we have here) the braces can be omitted entirely, they are only needed to group lines together into a single block.
cs: Pokud se v bloku nachází jen jediný řádek (jako v našem případě), můžeme závorky úplně vynechat. Potřebujeme je jen v případech, kdy mají ohraničit skupinu řádků, které patří do jednoho bloku.

source: Boolean Expressions You might remember that in the Raw Materials section we mentioned a Boolean type of data.
cs: Boolovské výrazy Možná si ještě vzpomínáte, že jsme se v kapitole o datech zmínili o datovém typu boolean.

source: We said it had only two values: True or False.
cs: Řekli jsme si, že má pouze dvě hodnoty: True a False.

source: We very rarely create a Boolean variable but we often create temporary Boolean values using expressions.
cs: Boolovské proměnné vytváříme velmi zřídka, ale dočasné boolovské hodnoty často vznikají jako výsledek vyhodnocení výrazů.

source: An expression is a combination of variables and values combined by operators to produce a resultant value.
cs: Výrazem rozumíme kombinaci proměnných a hodnot, spojených operátory s cílem vyprodukovat výslednou hodnotu.

source: In the following example: if x x is the expression and the result will be True if x is less than 5 and False if x is greater than or equal to 5.
cs: V následujícím příkladu if x < 5: print x je zápis x < 5 výrazem. Pokud je x menší než 5, bude jeho výsledkem hodnota True. Pokud je x větší nebo rovno 5, bude výsledkem výrazu hodnota False.

source: Expressions can be arbitrarily complex provided they evaluate to a single final value.
cs: Výrazy mohou být libovolně složité s tím, že výsledkem jejich vyhodnocení musí být nakonec vždy jediná hodnota.

source: In the case of a branch that value must be either True or False.
cs: V případě větvení musí být výsledkem pravdivostní hodnota True nebo False.

source: However, the definition of these 2 values varies from language to language.
cs: Nicméně, definice těchto dvou pravdivostních hodnot se jazyk od jazyka liší.

source: In many languages False is the same as 0 or a non-existent value (often called NULL, Nil or None).
cs: V mnoha jazycích je hodnota false ztotožněna s hodnotou 0 nebo s hodnotou vyjadřující neexistenci (té se často říká NULL, Nil nebo None).

source: Thus an empty list or string evaluates to false in a Boolean context.
cs: Takže v boolovském kontextu bude například prázdný seznam nebo prázdný řetězec vyhodnocen jako False.

source: Python works this way and this means we can use a while loop to process a list until the list is empty, using something like:
cs: Takovým způsobem se chová i Python. To znamená, že například můžeme využít cyklu while pro zpracování seznamu, které má skončit v okamžiku, kdy je seznam prázdný:

source: while aList: # do something here
cs: while seznam: # Proveď nějakou operaci, která vede ke zkrácení seznamu.

source: Or we can use an if statement to test whether a list is empty without resorting to the len() function like this: if aList: # do something here
cs: V příkazu if můžeme tento obrat použít k testování prázdnosti seznamu, aniž bychom použili funkci len() : if seznam: # něco zde udělej (seznam je prázdný)

source: Finally we can combine Boolean expressions using Boolean operators which can often cut down the number of if statements we need to write.
cs: Boolovské výrazy můžeme kombinovat pomocí boolovských operátorů. Často tím můžeme zmenšit počet příkazů if.

source: Consider this example:
cs: Uvažujme následující příklad:

source: if value > maximum: print "Value is out of range!" else if value < minimum: print "Value is out of range!"
cs: if hodnota > maximum: print "Hodnota je mimo rozsah!" else: if hodnota < minimum: print "Hodnota je mimo rozsah!"

source: Notice that the block of code executed is identical.
cs: Povšimněte si, že blok prováděného kódu je v obou případech shodný.

source: We can save some work, both for us and for the computer, by combining both of the tests into a single test like this:
cs: Zkombinováním obou testů do jednoho dosáhneme úspory práce jak pro počítač, tak pro nás:

source: if (value < minimum) or (value > maximum): print "Value is out of range!"
cs: if (hodnota > maximum) or (hodnota < minimum): print "Hodnota je mimo rozsah!"

source: Notice we combined both tests using a boolean or operator.
cs: Oba testy jsme spojili operátorem or (nebo, čili logickým součtem).

source: This is still a single expression because Python evaluates the first set of parentheses, then the second set of parentheses and finally combines the two calculated values to form the final single value, either True or False.
cs: Dostáváme jediný výraz. Python nejdříve vyhodnotí výraz uzavřený v první dvojici závorek, potom výraz v druhých závorkách a nakonec vypočtené hodnoty zpracuje do podoby jediné hodnoty — True nebo False.

source: Very often if we think carefully about the tests we need to carry out in natural language we will find ourselves using conjunctions like and, or and not.
cs: Pokud o prováděných testech uvažujeme v pojmech přirozeného jazyka, velmi často používáme spojky jako a (anglicky and), nebo (or), negace (ne, není, anglicky not).

source: If so there's a very good chance we can write a single combined test rather than many separate ones.
cs: V takovém případě je velmi pravděpodobné, že se nám místo více jednoduchých testů podaří zapsat jeden složený.

source: Chaining if statements
cs: Zřetězení příkazů if

source: You can go on to chain these if/then/else statements together by nesting them one inside the other.
cs: Příkazy if/then/else můžeme do sebe vnořovat.

source: Here is an example in Python:
cs: V jazyce Python to můžeme vyjádřit následovně:

source: # Assume price created previously... price = int(raw_input("What price? ")) if price == 100: print "I'll take it!" else: if price > 500: print "No way Jose!" else: if price > 200: print "How about throwing in a free mouse mat?" else: print "price is an unexpected value!"
cs: # Předpokládáme, že cena byla předem stanovena... cena = int(raw_input(u"Kolik to stojí? ")) if cena == 100: print u"Vezmu si to." else: if cena > 500: print u"Tak to nechci ani náhodou!" else: if cena > 200: print u"Co kdybyste přihodil zdarma podložku pod myš?" else: print u"Neočekávaná cena."

source: Note 1: we used == (that's a double = sign) to test for equality in the first if statement, whereas we use = to assign values to variables.
cs: Poznámka 1: V prvním příkazu if jsme pro test na rovnost použili operátor == (tj. zdvojený znak =). Jednoduchý znak = se používá pro přiřazování hodnot proměnným.

source: Using = when you mean to use == is one of the more common mistakes in programming Python, fortunately Python warns you that it's a syntax error, but you might need to look closely to spot the problem.
cs: Při programování v Pythonu (a také v C a v C++) patří použití jednoduchého = v místě, kde bychom chtěli použít == k nejčastějším chybám. Python vás v takovém případě naštěstí varuje, že jste se dopustili syntaktické chyby. Někdy se ale musíte pořádně podívat, než si všimnete, o co vlastně jde.

source: Note 2: A subtle point to notice is that we perform the greater-than tests from the highest value down to the lowest.
cs: Poznámka 2: Za povšimnutí stojí ještě jeden detail. Testy větší než provádíme od největší hodnoty k nejmenší.

source: If we did it the other way round the first test, which would be price > 200 would always be true and we would never progress to the > 500 test.
cs: Kdybychom postupovali obráceně a začali bychom testem cena > 200, pak bychom se nikdy nedostali k testu cena > 500.

source: Similarly if using a sequence of less-than tests you must start at the lowest value and work up.
cs: Při používání po sobě jdoucích testů menší než musíme naopak začít testovat na nejmenší hodnotu a postupovat směrem k hodnotám vyšším.

source: This is another very easy trap to fall into.
cs: Jde o další past, do které se můžeme při troše nepozornosti snadno chytit.

source: You can chain if statements in VBScript and JavaScript too but as it's pretty self evident I'll only show a VBScript example here:
cs: Příkazy if můžeme řetězit i v jazycích VBScript a JavaScript. Postup je zcela zřejmý. Proto si to ukážeme jen na příkladu v jazyce VBScript:

source: <script language="VBScript"> DIM Price price = InputBox("What's the price?") price = CInt(price) If price = 100 Then MsgBox "I'll take it!" Else: if price > 500 Then MsgBox "No way Jose!" else: if price > 200 Then MsgBox "How about throwing in a free mouse mat too?" else: MsgBox "price is an unexpected value!" End If End If End If </script>
cs: <script type="text/vbscript"> DIM Cena cena = InputBox("Kolik to stojí?") cena = CInt(cena) If cena = 100 Then MsgBox "Vezmu si to." Else: if cena > 500 Then MsgBox "Tak to nechci ani náhodou!" else: if cena > 200 Then MsgBox "Co kdybyste přihodil zdarma podložku pod myš?" else: MsgBox "Neočekávaná cena." End If End If End If </script>

source: The only things to note here are that there is an End If statement to match every If statement and that we used the VBScript conversion function CInt to convert from the input string value to an integer.
cs: Za zmínku zde stojí jedině to, že ke každému příkazu if musíme uvést odpovídající příklaz End If. Poznamenejme ještě, že pro převod řetězcové hodnoty na celočíselnou jsme použili funkci CInt().

source: Case statements
cs: Příkazy typu Case

source: One snag with chaining, or nesting if/else statements is that the indentation causes the code to spread across the page very quickly.
cs: S používáním zanořených příkazů if/else souvisí jedna potíž. Postupné odsazování způsobí, že se zdrojový text rychle roztáhne přes celou šířku stránky.

source: A sequence of nested if/else/if/else... is such a common construction that many languages provide a special type of branch for it.
cs: Posloupnost zanořených if/else/if/else… však patří k tak běžným konstrukcím, že některé jazyky poskytují speciální způsob větvení.

source: This is often referred to as a Case or Switch statement and the JavaScript version looks like:
cs: Zmíněné speciální konstrukce se často označují jako příkazy case nebo switch. V jazyce JavaScript vypadá příkaz switch následovně:

source: <script language="JavaScript"> function doArea(){ var shape, breadth, length, area; shape = document.area.shape.value; breadth = parseInt(document.area.breadth.value); len = parseInt(document.area.len.value); switch (shape){ case 'Square': area = len * len; alert("Area of " + shape + " = " + area); break; case 'Rectangle': area = len * breadth; alert("Area of " + shape + " = " + area); break; case 'Triangle': area = len * breadth / 2; alert("Area of " + shape + " = " + area); break; default: alert("No shape matching: " + shape) }; } </script>
cs: <script type="text/javascript"> function vypoctiPlochu() { var tvar, sirka, delka, plocha; tvar = document.plocha.tvar.value; sirka = parseInt(document.plocha.sirka.value); delka = parseInt(document.plocha.delka.value); switch (tvar) { case 'ctverec': plocha = delka * delka; alert("Plocha tvaru " + tvar + " = " + plocha); break; case 'obdelnik': plocha = delka * sirka; alert("Plocha tvaru " + tvar + " = " + plocha); break; case 'trojuhelnik': plocha = delka * sirka / 2; alert("Plocha tvaru " + tvar + " = " + plocha); break; default: alert("Neznámý tvar: " + tvar) }; } </script>

source: <form name="area"> Length: <input type="text" name="len"> Breadth: <input type="text" name="breadth"> Shape: <select name="shape" size=1 onChange="doArea()"> <option value="Square">Square <option value="Rectangle">Rectangle <option value="Triangle">Triangle </select> </form>
cs: <form name="plocha"> Délka: <input type="text" name="delka"> Šířka: <input type="text" name="sirka"> Tvar: <select name="tvar" size="1" onChange="vypoctiPlochu()"> <option value="ctverec">čtverec <option value="obdelnik">obdélník <option value="trojuhelnik">trojúhelník </select> </form>

source: The HTML form code just allows us to capture the details and then when the user selects a shape it calls our JavaScript function.
cs: Detaily jsou zachyceny v rámci HTML kódu formuláře. Jakmile si uživatel vybere tvar, zavolá se naše funkce.

source: The first few lines simply create some local variables and convert the strings to integers where needed.
cs: Na prvních řádcích se vytvářejí lokální proměnné a podle potřeby se řetězce převádějí na čísla.

source: The bold section is the bit we are really interested in.
cs: Zajímá nás úsek, který je vyznačen tučně.

source: It selects the appropriate action based on the shape value, notice, by the way, that the parentheses around shape are required.
cs: Podle vybraného tvaru se v něm vybírá příslušná akce. Povšimněte si kulatých závorek kolem identifikátoru tvar za klíčovým slovem switch. Jsou povinné — musí být uvedeny.

source: Each block of code within the case structure is not marked using curly braces, as you might expect, but is instead terminated by a break statement.
cs: Mohli byste předpokládat, že bloky kódu uvnitř case by měly být uzavřeny do složených závorek, ale není tomu tak. Místo toho jsou ukončovány příkazem break.

source: The entire set of case statements for the switch is, however, bound together as a block by a single set of curly braces.
cs: Nicméně celá sada příkazů case, která odpovídá části switch, již je svázána do podoby bloku jedním párem složených závorek.

source: Finally note the final condition is default which is simply a catch-all for anything not caught in the preceding Case statements.
cs: Povšimněte si, že poslední podmínka v příkladu má podobu default . V této části se zachytí všechny případy, které se nezachytily v předchozích částech case.

source: Why not see if you can extend the example to cover circles as well?
cs: Vyzkoušejte si, zda byste uměli výše uvedený příklad rozšířit tak, aby pracoval i s kruhem.

source: Remember to add a new option to the HTML form as well as a new case to the switch.
cs: Do HTML formuláře nezapomeňte přidat novou volbu a do příkazu switch přidejte další variantu case.

source: VBScript Select Case
cs: Příkaz Select Case v jazyce VBScript

source: VBScript has a version too:
cs: Verzi příkazu pro výběr jedné z několika variant nalezneme i v jazyce VBScript:

source: <script language="VBScript"> Dim shape, length, breadth, SQUARE, RECTANGLE, TRIANGLE SQUARE = 0 RECTANGLE = 1 TRIANGLE = 2 shape = CInt(InputBox("Square(0),Rectangle(1) or Triangle(2)?")) length = CDbl(InputBox("Length?")) breadth = CDbl(InputBox("Breadth?")) Select Case shape Case SQUARE area = length * length MsgBox "Area = " & area Case RECTANGLE area = length * breadth MsgBox "Area = " & area Case TRIANGLE area = length * breadth / 2 MsgBox "Area = " & area Case Else MsgBox "Shape not recognized" End Select </script>
cs: <script type="text/vbscript"> Dim tvar, delka, sirka, CTVEREC, OBDELNIK, TROJUHELNIK CTVEREC = 0 OBDELNIK = 1 TROJUHELNIK = 2 tvar = CInt(InputBox("Čtverec(0), obdélník(1) nebo trojúhelník(2)?")) delka = CDbl(InputBox("Délka?")) sirka = CDbl(InputBox("Šířka?")) Select Case tvar Case CTVEREC plocha = delka * delka MsgBox "Plocha = " & plocha Case OBDELNIK plocha = delka * sirka MsgBox "Plocha = " & plocha Case TROJUHELNIK plocha = delka * sirka / 2 MsgBox "Plocha = " & plocha Case Else MsgBox "Neznámý tvar" End Select </script>

source: As with the JavaScript example the first few lines simply collect the data from the user and convert it into the right type.
cs: Na několika prvních řádcích se od uživatele získávají data a převádějí se na správný typ — stejně, jako tomu bylo u příkladu v jazyce JavaScript.

source: The bold Select section shows the VBScript case construct with each successive Case statement active as a block terminator for the previous one.
cs: Tučně vyznačená část Select znázorňuje konstrukci typu case, jak se používá v jazyce VBScript. Zasebou uvedené příkazy Case vždy ukončují blok předchozího.

source: The whole Select construct is closed with the End Select statement.
cs: Celou konstrukci Select uzavírá příkaz End Select.

source: Finally there is a Case Else clause which, like the default in JavaScript catches anything not caught in the Case s above.
cs: Nalezneme zde také část Case Else, ve které se (jako v části default jazyka JavaScript) zachytí vše, co nebylo zpracováno dříve uvedenými částmi Case.

source: One other feature worth pointing out is the use of Symbolic Constants instead of numbers.
cs: Za zmínku stojí ještě použití symbolických konstant místo čísel.

source: That is the uppercase variables SQUARE, RECTANGLE and TRIANGLE are there simply to make the code easier to read.
cs: Proměnné zapsané velkými písmeny CTVEREC , OBDELNIK a TROJUHELNIK jsou zde jen kvůli tomu, aby se zdrojový text snadněji četl.
